cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Standard Brew packages
brew 'hub'                  # For using helpful command line github utilities
brew 'pre-commit'           # For pre-commit hooks
brew 'wget'                 # as basic as curl
brew 'curl'                 # see above

# python
brew 'pyenv'                # python shims
brew 'pyenv-virtualenv'     # python virtual env

# ruby
brew 'rbenv'                # Ruby env
brew 'mailpit'              # local mail

# node
brew 'npm'

# services
brew 'postgresql@15'        # Version 15
brew 'redis'                # k/v store
brew 'cloudflared'


# Cask is for installing mac applications
cask '1password'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'
